Revit 2024 API
ConduitSettings.GetConduitSettings Method
 Gets the conduit settings of the project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public static ConduitSettings GetConduitSettings(
	Document document
)
Visual Basic
Public Shared Function GetConduitSettings ( _
	document As Document _
) As ConduitSettings
Visual C++
public:
static ConduitSettings^ GetConduitSettings(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
Return Value
 The conduit settings of the project.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ConduitSettings Class
Autodesk.Revit.DB.Electrical Namespace